'''
    多维数组的切片
    数组[行切片,列切片]
    数组[页切片,行切片,列切片]

'''
import numpy as np
# ary = np.arange(1,10).reshape(3, 3)
# # 获取二维数组的前两行
# print(ary[:2])
# print("======================")

# # 获取前两行的前两列
# print(ary[:2, :2])
# print("======================")

# # 获取高维度数组切片时，需要再取出的数据后再继续切片才能获取到想要的数据
# bry = np.arange(1, 28).reshape(3,3,3)
# print(bry)
# print("======================")
# # 取最后一页的第二行数据, 后两个数据
# print(bry[2::, 1:2:, 1::])

ary = np.arange(1, 101).reshape(20, 5)
print(ary)
print('-----------------------')
# 获取 所有行的前4列
print(ary[::, :4:])
print('------------------------')
# 获取最后列是有的数据， 并转换为一维数组
print(ary[::, 4::].flatten())